bench/results/machine1/apiary-0.15.0/DEEP.log
/home/philopon/bench-0.1.0/wrk/wrk
Benchmarking DEEP
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.53ms   14.26ms 473.73ms   99.61%
    Req/Sec     4.36k     1.04k   10.21k    74.50%
  1008938 requests in 30.00s, 117.39MB read
  Socket errors: connect 0, read 0, write 0, timeout 18
Requests/sec:  33635.73
Transfer/sec:      3.91MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.95ms    7.29ms 533.48ms   99.65%
    Req/Sec     4.41k     0.90k   11.50k    77.75%
  1014027 requests in 30.00s, 117.98MB read
  Socket errors: connect 0, read 0, write 0, timeout 3
Requests/sec:  33800.32
Transfer/sec:      3.93MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.19ms   31.92ms 579.74ms   99.20%
    Req/Sec     4.45k     0.94k   13.10k    88.67%
  1018199 requests in 30.01s, 118.47MB read
  Socket errors: connect 0, read 0, write 0, timeout 4
Requests/sec:  33934.01
Transfer/sec:      3.95MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.59ms   19.42ms 424.07ms   99.71%
    Req/Sec     4.40k     1.09k   11.92k    78.91%
  1013912 requests in 30.00s, 117.97MB read
  Socket errors: connect 0, read 0, write 0, timeout 56
Requests/sec:  33797.11
Transfer/sec:      3.93MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.72ms   21.45ms 540.41ms   99.70%
    Req/Sec     4.42k     1.12k   10.83k    73.14%
  1020522 requests in 30.00s, 118.74MB read
Requests/sec:  34013.94
Transfer/sec:      3.96MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.17ms   14.81ms 564.89ms   99.88%
    Req/Sec     4.38k     1.17k   10.64k    68.95%
  1011106 requests in 30.01s, 117.64MB read
Requests/sec:  33697.45
Transfer/sec:      3.92MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.78ms   19.99ms 556.84ms   99.72%
    Req/Sec     4.38k     0.98k   12.25k    82.50%
  1009922 requests in 30.00s, 117.50MB read
Requests/sec:  33662.12
Transfer/sec:      3.92MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.24ms   12.96ms 448.35ms   99.75%
    Req/Sec     4.42k   801.61    12.90k    85.76%
  1010371 requests in 30.00s, 117.55MB read
  Socket errors: connect 0, read 0, write 0, timeout 43
Requests/sec:  33680.47
Transfer/sec:      3.92MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.80ms    2.04ms 306.52ms   90.55%
    Req/Sec     4.38k     0.94k   10.14k    68.47%
  1007763 requests in 30.01s, 117.25MB read
Requests/sec:  33585.32
Transfer/sec:      3.91MB
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.16ms   23.69ms 435.33ms   99.58%
    Req/Sec     4.42k     1.06k    9.78k    77.75%
  1017674 requests in 30.00s, 118.40MB read
Requests/sec:  33922.54
Transfer/sec:      3.95MB
=================== summary ===================
bench target: apiary
bench mode:   30s * 10
average:      33772.90
stdev:        144.64