bench/results/machine1/apiary-0.15.0/PARAM.log
/home/philopon/bench-0.1.0/wrk/wrk
Benchmarking PARAM
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.44ms   19.17ms 514.09ms   99.67%
    Req/Sec     4.16k     1.01k   10.36k    81.56%
  957901 requests in 30.00s, 112.36MB read
Requests/sec:  31930.90
Transfer/sec:      3.75MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.28ms    2.75ms 371.37ms   92.48%
    Req/Sec     4.20k     0.85k   10.71k    75.59%
  967804 requests in 30.00s, 113.53MB read
Requests/sec:  32263.68
Transfer/sec:      3.78MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.55ms   44.24ms 693.97ms   99.47%
    Req/Sec     4.15k     0.94k   12.17k    86.16%
  956864 requests in 30.00s, 112.24MB read
Requests/sec:  31890.45
Transfer/sec:      3.74MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.24ms   22.08ms 490.58ms   99.75%
    Req/Sec     4.19k     1.09k   10.71k    81.66%
  970969 requests in 30.00s, 113.90MB read
  Socket errors: connect 0, read 0, write 0, timeout 40
Requests/sec:  32364.66
Transfer/sec:      3.80MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.28ms   55.49ms 714.21ms   99.21%
    Req/Sec     4.12k   835.84    11.83k    87.75%
  951321 requests in 30.00s, 111.59MB read
Requests/sec:  31712.49
Transfer/sec:      3.72MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    13.34ms   19.40ms 604.66ms   99.71%
    Req/Sec     4.17k     0.92k    9.69k    82.29%
  964858 requests in 30.00s, 113.18MB read
Requests/sec:  32163.60
Transfer/sec:      3.77MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.08ms   50.49ms 728.88ms   99.45%
    Req/Sec     4.15k     0.86k   11.20k    87.51%
  953097 requests in 30.00s, 111.80MB read
Requests/sec:  31769.26
Transfer/sec:      3.73MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.23ms   30.15ms 358.99ms   99.02%
    Req/Sec     4.14k     1.01k   11.23k    81.15%
  960503 requests in 30.00s, 112.67MB read
  Socket errors: connect 0, read 0, write 0, timeout 74
Requests/sec:  32015.23
Transfer/sec:      3.76MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    12.74ms   14.41ms 748.35ms   99.82%
    Req/Sec     4.16k   832.41    12.30k    80.96%
  960091 requests in 30.00s, 112.62MB read
Requests/sec:  32001.02
Transfer/sec:      3.75MB
Running 30s test @ http://localhost:8080/echo/plain/hello
  8 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.38ms   36.22ms 688.39ms   99.64%
    Req/Sec     4.18k     0.92k   11.42k    86.79%
  959213 requests in 30.00s, 112.52MB read
Requests/sec:  31969.70
Transfer/sec:      3.75MB
=================== summary ===================
bench target: apiary
bench mode:   30s * 10
average:      32008.10
stdev:        206.14